{
  "backend/main.mo": "Main backend actor implementing a multi-game-mode ICP trading game with account management, leveraged positions (long/short with liquidation), leaderboards, winners tracking, access control, and HTTP outcalls for ICP price fetching.",
  "feature_evidence.json": "Feature evidence report documenting implemented technical analysis features (RSI, MACD, moving averages, trendline drawing) and CoinGecko API integration with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing the trading interface, technical analysis charts, portfolio management, leaderboards, game modes, and React hooks for data fetching and state management.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining dark trading theme with custom CSS variables for light/dark modes and chart colors.",
  "frontend/index.html": "HTML entry point for the ICP Trading Game React application with viewport meta tags and root div.",
  "frontend/src/App.tsx": "Main application component managing authentication flow, game mode context, and tabbed navigation between trading (with metrics), positions, portfolio, and leaderboard views with auto-account creation on login.",
  "frontend/src/components/GameModeSelector.tsx": "Button group component for selecting between four game modes (24h, 7d, 30d, 1y) with active state styling using the GameModeContext.",
  "frontend/src/components/GameTimer.tsx": "Countdown timer card displaying days, hours, minutes, and seconds remaining until the next game mode reset with formatted monospace display.",
  "frontend/src/components/Leaderboard.tsx": "Displays a ranked leaderboard of traders by profit/loss for the selected game mode (daily/weekly/monthly/yearly), showing portfolio values, P&L percentages, and trophy icons for top three positions.",
  "frontend/src/components/MACDChart.tsx": "Renders a MACD technical indicator chart with histogram bars, MACD line, and signal line using Recharts, with conditional coloring and time-based formatting.",
  "frontend/src/components/MovingAverageToggles.tsx": "Provides toggle buttons for enabling/disabling four moving averages (MA20, MA50, MA100, MA200) with color-coded styling.",
  "frontend/src/components/Portfolio.tsx": "Displays user portfolio metrics including cash balance, ICP holdings, margin locked, unrealized P&L, total portfolio value, and overall profit/loss with an admin-only reset account feature.",
  "frontend/src/components/Positions.tsx": "Shows a table of active leveraged long/short positions with details like entry price, current price, margin, unrealized P&L, liquidation price, and close position actions.",
  "frontend/src/components/PriceChart.tsx": "Main price chart component with multiple timeframes, technical indicators (RSI, MACD, moving averages), trendline drawing tools, and reference lines for position entry prices.",
  "frontend/src/components/RSIChart.tsx": "Renders a Relative Strength Index (RSI) chart with overbought/oversold reference lines at 70/30, using Recharts with time-based X-axis formatting and custom tooltips.",
  "frontend/src/components/TradingMetrics.tsx": "Displays Kong Swap trading metrics in a tabbed interface showing overview (RSI, volatility, moving averages), volume charts, liquidity data, and order book information using Recharts visualizations.",
  "frontend/src/components/TradingPanel.tsx": "Provides a tabbed trading interface for buying/selling ICP (with ICP/dollar input toggle and max buttons) and opening leveraged long/short positions with configurable leverage multipliers.",
  "frontend/src/components/TrendlineDrawingTool.tsx": "Interactive SVG-based tool for drawing, displaying, and deleting trendlines on charts with mouse events, requiring minimum line length and providing drawing mode toggle.",
  "frontend/src/components/WinnersSection.tsx": "Displays a table of past winners for the current game mode, showing winner profiles, final portfolio values, profit/loss percentages, and timestamps sorted by most recent.",
  "frontend/src/contexts/GameModeContext.tsx": "React context provider for managing and persisting the current game mode (daily/weekly/monthly) to localStorage with type-safe access hooks.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGameTimer.ts": "React hook that calculates and updates countdown timers for game mode resets (daily, weekly, monthly, yearly) based on UTC time boundaries.",
  "frontend/src/hooks/useICPPriceData.ts": "React Query hooks for fetching current and historical ICP price data from CoinGecko API with fallback to synthetic data generation when API is unavailable.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useKongSwapMetrics.ts": "React Query hook that fetches ICP trading metrics from KongSwap API including volume, liquidity, order book data, and technical indicators with synthetic fallback data.",
  "frontend/src/hooks/useLeaderboard.ts": "React Query hook that fetches and calculates leaderboard rankings by combining player account data with current ICP prices to compute total portfolio values and profit/loss.",
  "frontend/src/hooks/useLeverageActions.ts": "React Query mutations for opening long/short leveraged positions and closing positions, with automatic cache invalidation and toast notifications for success/error states.",
  "frontend/src/hooks/usePortfolio.ts": "React Query hook that aggregates user portfolio data including cash, ICP holdings, margin locked in positions, unrealized P&L, and total portfolio value with profit/loss calculation.",
  "frontend/src/hooks/usePositions.ts": "React Query hook that fetches open leveraged positions and calculates real-time unrealized profit/loss based on current ICP price and position parameters.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching leaderboard data and checking admin status from the backend actor.",
  "frontend/src/hooks/useTradingActions.ts": "Provides trading action hooks (buy, sell, reset) that interact with the backend actor, handle loading states, display toast notifications, and invalidate queries on success.",
  "frontend/src/hooks/useTrendlines.ts": "Manages trendline state with functions to add, remove, and clear trendlines for chart drawing.",
  "frontend/src/hooks/useWinners.ts": "React Query hook that fetches winners data for a specific game mode from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/technicalIndicators.ts": "Implements technical analysis calculations including SMA, EMA, RSI, and MACD indicators for price data.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors, typography, animations, and design tokens using OKLCH color space.",
  "project_state.json": "Project configuration file defining an ICP trading simulator with multiple game modes (24h/7d/30d/1yr), leveraged trading (2x-20x), technical analysis tools (RSI/MACD/trendlines), leaderboards, and real-time price charts. Documents known issues with buy transaction balance deduction and inaccurate Kong Swap API price data that needs replacement with reliable crypto data provider."
}