{
  "backend/main.mo": "Main Motoko actor implementing a multi-game-mode ICP trading game with account management, buy/sell operations, leaderboards, winners tracking, and role-based access control using authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: displaying ICP holdings in sell section, MAX button for selling all ICP, and MAX button for buying with available cash.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components for trading, portfolio, leaderboard, game mode selection, timers, and custom hooks for data fetching and state management.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark themes for a trading interface with emerald/teal accents.",
  "frontend/index.html": "HTML entry point for the ICP Trading Game React application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application component managing authentication flow, game mode context, and tabbed navigation between trade, portfolio, and leaderboard views with auto-account creation.",
  "frontend/src/components/GameModeSelector.tsx": "Button group component for selecting between daily, weekly, monthly, and yearly game modes using the GameModeContext.",
  "frontend/src/components/GameTimer.tsx": "Countdown timer display showing days, hours, minutes, and seconds remaining until the next game mode reset.",
  "frontend/src/components/Leaderboard.tsx": "Game-mode-specific leaderboard table displaying ranked traders with trophy icons, portfolio values, P&L metrics, and a WinnersSection for historical winners.",
  "frontend/src/components/Portfolio.tsx": "Displays user portfolio with cash balance, ICP holdings, total value, and profit/loss metrics. Includes admin-only reset account functionality with confirmation dialog.",
  "frontend/src/components/PriceChart.tsx": "Renders an interactive ICP price chart using Recharts with multiple timeframe options (24H to 180D), showing current price and percentage change with trend indicators.",
  "frontend/src/components/TradingPanel.tsx": "Provides buy/sell trading interface with dual input modes (ICP or dollar amounts), max buttons for quick trades, and real-time cost/proceeds calculations with validation.",
  "frontend/src/components/WinnersSection.tsx": "Displays a table of past winners for the selected game mode, showing winner profiles, final portfolio values, profit/loss percentages, and timestamps sorted by most recent.",
  "frontend/src/contexts/GameModeContext.tsx": "React context provider for managing game mode state (daily/weekly/monthly/yearly) with localStorage persistence across sessions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, handling actor recreation on identity changes and query invalidation.",
  "frontend/src/hooks/useGameTimer.ts": "Calculates and updates countdown timer for game mode resets (daily/weekly/monthly/yearly), returning days, hours, minutes, and seconds remaining until next reset.",
  "frontend/src/hooks/useICPPriceData.ts": "Fetches ICP price data from CoinGecko API for various timeframes and provides current price query with automatic refetching intervals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and integration with @dfinity/auth-client.",
  "frontend/src/hooks/useLeaderboard.ts": "Fetches and processes leaderboard data by calculating total portfolio value and profit/loss for each player, sorted by performance.",
  "frontend/src/hooks/usePortfolio.ts": "Retrieves and calculates the current user's portfolio including cash balance, ICP holdings, and total value using identity and current ICP price.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching leaderboard data and checking admin status from the backend actor.",
  "frontend/src/hooks/useTradingActions.ts": "Provides functions for buying/selling ICP and resetting accounts with loading states, error handling, and query cache invalidation.",
  "frontend/src/hooks/useWinners.ts": "React Query hook that fetches the list of winners for a specific game mode from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage, supporting both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH colors, typography, animations, and container settings.",
  "project_state.json": "Project state file documenting an ICP trading simulator with multiple game modes (24h/7d/30d/1yr), real-time price charts, virtual $10,000 trading accounts, leaderboards, and admin controls. Known issues include buy transactions not deducting cash and inaccurate ICP purchase calculations."
}