{
  "backend/main.mo": "Main backend actor implementing a trading game with user registration, account management, buy/sell transactions, leveraged positions, leaderboards, and role-based access control across multiple game modes (daily/weekly/monthly/yearly).",
  "feature_evidence.json": "Feature evidence report documenting that the frontend trading panel correctly handles registration check responses and displays appropriate error messages, with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components for trading, portfolio, leaderboard, charts, authentication flow, and React Query hooks for data fetching and state management.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark themes with custom design tokens for a financial trading interface aesthetic.",
  "frontend/index.html": "HTML entry point for the ICP Trading Game application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component orchestrating authentication, user registration flow with state machine (checking/needs-registration/registration-success/registered), account initialization with retry logic, and tabbed navigation between trading views.",
  "frontend/src/components/GameModeSelector.tsx": "Button group component for selecting game modes (24h, 7d, 30d, 1y) with active state styling using the GameModeContext.",
  "frontend/src/components/GameTimer.tsx": "Countdown timer component displaying days, hours, minutes, and seconds until the next game mode reset with real-time updates.",
  "frontend/src/components/Leaderboard.tsx": "Game-mode-specific leaderboard table displaying ranked traders by portfolio value with trophy icons for top three, loading states, and integration with WinnersSection component.",
  "frontend/src/components/MACDChart.tsx": "Renders a MACD (Moving Average Convergence Divergence) indicator chart with histogram bars, MACD line, and signal line using Recharts. Supports multiple timeframes with conditional formatting and custom tooltips.",
  "frontend/src/components/MovingAverageToggles.tsx": "Provides toggle buttons for enabling/disabling four moving averages (MA20, MA50, MA100, MA200) with color-coded styling. Each button changes appearance based on its enabled state.",
  "frontend/src/components/Portfolio.tsx": "Displays portfolio overview including cash balance, ICP holdings, total value, and realized P&L with loading and error states. Uses the usePortfolio hook to fetch and display portfolio data.",
  "frontend/src/components/Positions.tsx": "Shows a table of open leveraged positions (long/short) with details like entry price, P&L, liquidation price, and close action buttons. Includes liquidation warnings and loading states using usePositions and useLeverageActions hooks.",
  "frontend/src/components/PriceChart.tsx": "Main price chart component displaying ICP price with toggleable moving averages (MA20, MA50, MA100, MA200) and integrating RSI and MACD sub-charts. Uses technical indicator calculations and Recharts for visualization.",
  "frontend/src/components/RegistrationForm.tsx": "React form component for user registration with display name validation (2-50 chars), error handling, and integration with useRegisterUser mutation hook.",
  "frontend/src/components/RegistrationSuccess.tsx": "Success screen component displayed after registration, showing welcome message, starting balance of $10,000, and a button to continue to trading.",
  "frontend/src/components/RSIChart.tsx": "Renders an RSI (Relative Strength Index) indicator chart with overbought (70) and oversold (30) reference lines. Supports multiple timeframes with formatted timestamps and custom tooltips.",
  "frontend/src/components/TradingMetrics.tsx": "Empty file with no content.",
  "frontend/src/components/TradingPanel.tsx": "Trading interface component with buy/sell tabs, USD/ICP amount inputs with automatic conversion, and transaction execution with toast notifications for success/error states.",
  "frontend/src/components/TransactionHistory.tsx": "Table component displaying user transaction history with columns for type (buy/sell), timestamp, ICP amount, price, total, and balances after each transaction.",
  "frontend/src/components/TrendlineDrawingTool.tsx": "Interactive SVG-based drawing tool allowing users to draw, display, and delete trendlines on price charts with mouse events and drawing mode toggle.",
  "frontend/src/components/WinnersSection.tsx": "Card component displaying historical winners table for the selected game mode, showing player ID, final portfolio value, profit/loss, and reset date.",
  "frontend/src/contexts/GameModeContext.tsx": "React context provider for managing global game mode state (daily/weekly/monthly) with localStorage persistence across sessions.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGameTimer.ts": "Provides a countdown timer for game modes (daily, weekly, monthly, yearly) that calculates time remaining until the next reset in UTC.",
  "frontend/src/hooks/useICPPriceData.ts": "Fetches ICP price data from CoinGecko API for various timeframes, falling back to synthetic data with a $100 baseline if the API fails.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useKongSwapMetrics.ts": "Empty file with no content.",
  "frontend/src/hooks/useLeaderboard.ts": "Queries leaderboard data by game mode and current ICP price, currently returning empty arrays as backend support is not yet implemented.",
  "frontend/src/hooks/useLeverageActions.ts": "Provides mutations for opening long/short leveraged positions and closing them, but all operations throw errors as leverage trading is not yet implemented in the backend.",
  "frontend/src/hooks/usePortfolio.ts": "Fetches user portfolio data including cash balance, ICP holdings, total value, and realized P&L, calculating values based on current ICP price.",
  "frontend/src/hooks/usePositions.ts": "Queries leveraged trading positions by game mode and price, currently returning empty arrays as backend support for leverage positions is not yet implemented.",
  "frontend/src/hooks/useQueries.ts": "Provides queries for leaderboard, admin status check, user profile retrieval, and user registration mutation with proper cache invalidation.",
  "frontend/src/hooks/useTradingActions.ts": "Provides mutations for buying and selling ICP with error parsing that handles insufficient balance, authorization, and connection errors, invalidating relevant queries on success.",
  "frontend/src/hooks/useTransactionHistory.ts": "Custom React hook that fetches transaction history from the backend actor using React Query, with automatic refetching every 30 seconds when user is authenticated.",
  "frontend/src/hooks/useTrendlines.ts": "Custom React hook for managing chart trendlines with state management for adding, removing, and clearing trendlines with unique IDs.",
  "frontend/src/hooks/useWinners.ts": "Custom React hook that queries winners data by game mode from the backend actor, though the backend function is not yet implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, including chart colors and design tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/types/game.ts": "TypeScript type definitions for game-related entities including GameMode, UserProfile, Account, Winner, LeveragedPosition, and LeaderboardEntry.",
  "frontend/src/utils/technicalIndicators.ts": "Utility functions for calculating technical trading indicators including RSI, MACD, SMA, and EMA from price data arrays.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, font families, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project metadata tracking a fix request for registration verification logic in the ICP purchase flow, with one known issue about registration flow not recognizing registered users."
}