{
  "backend/main.mo": "Main actor implementing a trading game with user registration, account management, leveraged positions, transaction ledger, game modes, leaderboard winners, and role-based access control using MixinAuthorization.",
  "backend/migration.mo": "Migration module defining data structures (Account, GameModeData with accounts, winners, positions, transactions) and a pass-through migration function that preserves existing state.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: registration form component, App.tsx registration flow integration, and registration success confirmation with their associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including authentication flow, trading panel, portfolio dashboard, leaderboard, price charts with technical indicators, React Query hooks, and game mode management.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a trading application UI with custom chart colors and sidebar styling.",
  "frontend/index.html": "HTML entry point for the ICP Trading Game application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component orchestrating authentication via Internet Identity, registration state machine (checking/needs-registration/registration-success/registered), account initialization with retry logic, and tabbed navigation between trading views.",
  "frontend/src/components/GameModeSelector.tsx": "Button group component for selecting game modes (24h, 7d, 30d, 1y) with active state styling using the GameModeContext.",
  "frontend/src/components/GameTimer.tsx": "Countdown timer card displaying days, hours, minutes, and seconds until the next game mode reset using the useGameTimer hook.",
  "frontend/src/components/Leaderboard.tsx": "Displays a ranked leaderboard of traders by profit/loss for the selected game mode (daily/weekly/monthly/yearly), showing rank, trader name/principal, portfolio value, and P&L with trophy icons for top 3 positions.",
  "frontend/src/components/MACDChart.tsx": "Renders a MACD technical indicator chart with histogram bars (colored by positive/negative), MACD line, and signal line, with tooltips showing values and time-based X-axis formatting.",
  "frontend/src/components/MovingAverageToggles.tsx": "Provides toggle buttons for enabling/disabling four moving averages (MA20, MA50, MA100, MA200) with color-coded styling when active.",
  "frontend/src/components/Portfolio.tsx": "Displays user portfolio overview including cash balance, ICP holdings with USD value, total portfolio value, and realized P&L with profit/loss indicators.",
  "frontend/src/components/Positions.tsx": "Shows a table of open leveraged positions with details like type (long/short), leverage, entry/current/liquidation prices, margin, P&L, and a close button for each position.",
  "frontend/src/components/PriceChart.tsx": "Main ICP price chart component with toggleable moving averages (MA20/50/100/200), integrating RSI and MACD indicators, displaying current price and historical price data with technical analysis overlays.",
  "frontend/src/components/RegistrationForm.tsx": "Provides a user registration form with display name validation (2-50 characters), error handling, and integration with the useRegisterUser mutation hook.",
  "frontend/src/components/RegistrationSuccess.tsx": "Displays a success screen after user registration showing the welcome message, $10,000 starting balance, and a button to continue to trading.",
  "frontend/src/components/RSIChart.tsx": "Renders a Relative Strength Index (RSI) chart with overbought/oversold reference lines at 70/30, using Recharts library with responsive container and time-based X-axis formatting.",
  "frontend/src/components/TradingMetrics.tsx": "Empty file with no content.",
  "frontend/src/components/TradingPanel.tsx": "Implements the main trading interface with tabs for buying/selling ICP, bidirectional USD/ICP amount conversion, and integration with buy/sell mutation hooks with toast notifications.",
  "frontend/src/components/TransactionHistory.tsx": "Displays a table of user transactions showing buy/sell type, timestamp, ICP amount, price, total value, and resulting balances with loading and empty states.",
  "frontend/src/components/TrendlineDrawingTool.tsx": "Provides an interactive SVG-based tool for drawing, displaying, and removing trendlines on charts with mouse-based drawing mode and clickable deletion.",
  "frontend/src/components/WinnersSection.tsx": "Displays a table of historical winners for the selected game mode, showing player principal, final portfolio value, profit/loss, and reset date with loading and empty states.",
  "frontend/src/contexts/GameModeContext.tsx": "Provides React context for managing game mode state (daily/weekly/monthly/yearly) with localStorage persistence across page reloads.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useGameTimer.ts": "Calculates and updates remaining time until next game reset based on game mode (daily/weekly/monthly/yearly) with UTC-based reset times.",
  "frontend/src/hooks/useICPPriceData.ts": "Fetches ICP price data from CoinGecko API for various timeframes (1h/24h/7d/30d) with fallback to synthetic data generation if API fails.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useKongSwapMetrics.ts": "Empty file with no content.",
  "frontend/src/hooks/useLeaderboard.ts": "Queries leaderboard data for the current game mode but returns empty array as backend doesn't support leaderboard functionality yet.",
  "frontend/src/hooks/useLeverageActions.ts": "Provides mutations for opening long/short positions and closing positions, but all operations throw errors as leverage trading is not yet implemented in backend.",
  "frontend/src/hooks/usePortfolio.ts": "Fetches user's portfolio data including cash balance, ICP holdings, and calculates total value and realized PnL based on current ICP price.",
  "frontend/src/hooks/usePositions.ts": "Queries user's leverage positions for the current game mode but returns empty array as backend doesn't support leverage positions yet.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching leaderboard data, checking admin status, getting user profiles, and registering users via the backend actor.",
  "frontend/src/hooks/useTradingActions.ts": "Provides mutation hooks for buying and selling ICP with error parsing, account creation checks, and automatic query invalidation on success.",
  "frontend/src/hooks/useTransactionHistory.ts": "Fetches and returns transaction history from the backend actor with automatic refetching every 30 seconds.",
  "frontend/src/hooks/useTrendlines.ts": "Manages local state for chart trendlines with functions to add, remove, and clear trendlines.",
  "frontend/src/hooks/useWinners.ts": "Query hook for fetching game winners by mode; currently returns empty array as backend function is not yet implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers and renders the root App component.",
  "frontend/src/types/game.ts": "Defines TypeScript types for game modes, user profiles, accounts, winners, positions, and leaderboard entries not exported from backend.",
  "frontend/src/utils/technicalIndicators.ts": "Implements technical analysis calculations including RSI, MACD, SMA, and EMA for price chart indicators.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors, typography, animations, and design tokens using OKLCH color space.",
  "project_state.json": "Project state tracking file for an ICP Trading Game application with user registration features. Contains three completed features (registration form, App.tsx integration, success confirmation) and one pending backend feature request for user registration endpoint."
}