{
  "kind": "build_request",
  "title": "Add technical analysis indicators and switch to accurate CoinGecko pricing",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-58",
      "text": "Add RSI (Relative Strength Index) indicator overlay to the PriceChart component, displaying RSI values (0-100) calculated from historical price data with a separate chart panel below the main price chart",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Yeah trading tools like rsi macd ect. Can you do that?"
        ]
      },
      "acceptanceCriteria": [
        "RSI indicator is displayed in a separate panel below the main price chart",
        "RSI values range from 0-100 and are calculated from historical ICP price data",
        "RSI panel includes horizontal reference lines at 30 (oversold) and 70 (overbought) levels",
        "RSI values update automatically when timeframe changes (24h, 7d, 30d, 90d, 180d)"
      ]
    },
    {
      "id": "REQ-59",
      "text": "Add MACD (Moving Average Convergence Divergence) indicator overlay to the PriceChart component, displaying MACD line, signal line, and histogram in a separate chart panel",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Yeah trading tools like rsi macd ect. Can you do that?"
        ]
      },
      "acceptanceCriteria": [
        "MACD indicator is displayed in a separate panel below the RSI panel",
        "MACD panel shows three components: MACD line, signal line, and histogram bars",
        "MACD values are calculated from historical ICP price data using standard 12/26/9 parameters",
        "Histogram bars are colored green for positive values and red for negative values",
        "MACD values update automatically when timeframe changes"
      ]
    },
    {
      "id": "REQ-60",
      "text": "Add moving average overlays (SMA/EMA) to the main price chart, allowing users to toggle between different period lengths (20, 50, 100, 200) for trend analysis",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Yeah trading tools like rsi macd ect. Can you do that?"
        ]
      },
      "acceptanceCriteria": [
        "Moving average lines are overlaid directly on the main price chart",
        "Users can toggle visibility of individual moving averages (20, 50, 100, 200 periods)",
        "Each moving average is displayed with a distinct color for easy identification",
        "Moving averages are calculated from historical ICP price data and update with timeframe changes",
        "Toggle controls are accessible and clearly labeled with period lengths"
      ]
    },
    {
      "id": "REQ-61",
      "text": "Add interactive trendline drawing tool to the PriceChart component, allowing users to click and drag to draw custom trendlines on the price chart for technical analysis",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12"
        ],
        "quotes": [
          "Making trend lines and what not"
        ]
      },
      "acceptanceCriteria": [
        "Users can click and drag on the price chart to draw custom trendlines",
        "Trendlines persist on the chart until manually removed by the user",
        "Users can draw multiple trendlines on the same chart",
        "Trendlines scale appropriately when timeframe or zoom level changes",
        "A clear button or tool allows users to remove individual trendlines or clear all at once"
      ]
    },
    {
      "id": "REQ-62",
      "text": "Update useICPPriceData hook (frontend/src/hooks/useICPPriceData.ts) to integrate CoinGecko API for fetching current ICP price and historical price data, ensuring accurate real-time market prices that match major exchanges like Binance and Coinbase",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-14"
        ],
        "quotes": [
          "The price should be the real price of ICP. The last one from Kong swap has a game nonsense price that didn't represent ICP at all"
        ]
      },
      "acceptanceCriteria": [
        "CoinGecko API is used to fetch current ICP spot price",
        "Historical price data is fetched from CoinGecko for all supported timeframes (24h, 7d, 30d, 90d, 180d)",
        "Price data accurately reflects ICP prices from major exchanges",
        "API requests include proper error handling and fallback mechanisms",
        "Price updates occur at appropriate intervals to maintain accuracy"
      ]
    }
  ],
  "constraints": [
    "Do not modify frontend/src/hooks/useInternetIdentity.ts",
    "Do not modify frontend/src/hooks/useInternetIdentity.tsx",
    "Do not modify frontend/src/hooks/useActor.ts",
    "Do not modify frontend/src/main.tsx",
    "Do not modify frontend/src/components/ui directory",
    "Maintain single-actor architecture in backend/main.mo",
    "Use CoinGecko API as the primary data source for ICP pricing",
    "All technical indicators must be calculated client-side from fetched price data"
  ],
  "nonGoals": [
    "Implementing real trading with actual cryptocurrency",
    "Adding support for cryptocurrencies other than ICP",
    "Creating custom charting library from scratch",
    "Implementing server-side indicator calculations",
    "Adding alerts or notifications for indicator signals",
    "Implementing automated trading based on technical indicators"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}