{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add technical analysis indicators and switch to accurate CoinGecko pricing",
  "requirements": [
    {
      "id": "REQ-58",
      "summary": "Add RSI indicator overlay to PriceChart component with separate panel below main chart showing values 0-100 with oversold/overbought reference lines",
      "acceptanceCriteria": [
        "RSI indicator is displayed in a separate panel below the main price chart",
        "RSI values range from 0-100 and are calculated from historical ICP price data",
        "RSI panel includes horizontal reference lines at 30 (oversold) and 70 (overbought) levels",
        "RSI values update automatically when timeframe changes (24h, 7d, 30d, 90d, 180d)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/technicalIndicators.ts",
          "operation": "create",
          "description": "Create utility module with RSI calculation function that takes price array and period (default 14) and returns array of RSI values. RSI formula: RSI = 100 - (100 / (1 + RS)) where RS = average gain / average loss over period."
        },
        {
          "path": "frontend/src/components/RSIChart.tsx",
          "operation": "create",
          "description": "Create RSI chart component that renders RSI values in a separate panel using Recharts. Include horizontal reference lines at 30 (oversold, green) and 70 (overbought, red). Display RSI value range 0-100 on Y-axis. Style to match existing PriceChart dark theme with emerald/red accents."
        },
        {
          "path": "frontend/src/components/PriceChart.tsx",
          "operation": "modify",
          "description": "Integrate RSIChart component below the main price chart. Pass historical price data and selected timeframe to RSIChart. Calculate RSI values from priceData using the technicalIndicators utility. Maintain responsive layout with proper spacing between main chart and RSI panel."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Add MACD indicator overlay to PriceChart component with MACD line, signal line, and histogram in separate panel below RSI",
      "acceptanceCriteria": [
        "MACD indicator is displayed in a separate panel below the RSI panel",
        "MACD panel shows three components: MACD line, signal line, and histogram bars",
        "MACD values are calculated from historical ICP price data using standard 12/26/9 parameters",
        "Histogram bars are colored green for positive values and red for negative values",
        "MACD values update automatically when timeframe changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/technicalIndicators.ts",
          "operation": "modify",
          "description": "Add MACD calculation functions: calculateEMA for exponential moving average, calculateMACD that returns {macdLine, signalLine, histogram} using standard 12/26/9 parameters. MACD = EMA(12) - EMA(26), Signal = EMA(9) of MACD, Histogram = MACD - Signal."
        },
        {
          "path": "frontend/src/components/MACDChart.tsx",
          "operation": "create",
          "description": "Create MACD chart component rendering MACD line (blue), signal line (orange), and histogram bars using Recharts ComposedChart. Color histogram bars green for positive values, red for negative. Include zero reference line. Style to match dark trading theme."
        },
        {
          "path": "frontend/src/components/PriceChart.tsx",
          "operation": "modify",
          "description": "Integrate MACDChart component below RSIChart. Pass historical price data to calculate MACD values. Ensure proper vertical stacking of main chart, RSI panel, and MACD panel with consistent styling and spacing."
        }
      ]
    },
    {
      "id": "REQ-60",
      "summary": "Add moving average overlays (SMA/EMA) to main price chart with toggleable visibility for 20, 50, 100, 200 periods",
      "acceptanceCriteria": [
        "Moving average lines are overlaid directly on the main price chart",
        "Users can toggle visibility of individual moving averages (20, 50, 100, 200 periods)",
        "Each moving average is displayed with a distinct color for easy identification",
        "Moving averages are calculated from historical ICP price data and update with timeframe changes",
        "Toggle controls are accessible and clearly labeled with period lengths"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/technicalIndicators.ts",
          "operation": "modify",
          "description": "Add calculateSMA function that takes price array and period, returns simple moving average array. Add calculateEMA if not already present from MACD requirement."
        },
        {
          "path": "frontend/src/components/MovingAverageToggles.tsx",
          "operation": "create",
          "description": "Create component with four toggle buttons for MA periods (20, 50, 100, 200). Each toggle displays period label with corresponding color indicator. Use state to track enabled/disabled status for each MA. Style as compact inline controls matching trading theme."
        },
        {
          "path": "frontend/src/components/PriceChart.tsx",
          "operation": "modify",
          "description": "Add MovingAverageToggles component above the main price chart. Calculate SMA values for enabled periods (20, 50, 100, 200) from priceData. Overlay MA lines on main chart using Recharts Line components with distinct colors: MA20 (yellow), MA50 (cyan), MA100 (magenta), MA200 (orange). Only render lines for enabled MAs."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Add interactive trendline drawing tool to PriceChart allowing users to click and drag custom trendlines for technical analysis",
      "acceptanceCriteria": [
        "Users can click and drag on the price chart to draw custom trendlines",
        "Trendlines persist on the chart until manually removed by the user",
        "Users can draw multiple trendlines on the same chart",
        "Trendlines scale appropriately when timeframe or zoom level changes",
        "A clear button or tool allows users to remove individual trendlines or clear all at once"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTrendlines.ts",
          "operation": "create",
          "description": "Create hook managing trendline state with array of trendlines (each containing start/end coordinates and id). Provide functions: addTrendline, removeTrendline, clearAllTrendlines. Store trendlines in component state (not localStorage since they should reset on page refresh)."
        },
        {
          "path": "frontend/src/components/TrendlineDrawingTool.tsx",
          "operation": "create",
          "description": "Create component that overlays on PriceChart for drawing trendlines. Handle mouse events (onMouseDown, onMouseMove, onMouseUp) to capture click-drag gestures. Convert pixel coordinates to chart data coordinates. Render SVG lines for each trendline. Include drawing mode toggle button and clear all button."
        },
        {
          "path": "frontend/src/components/PriceChart.tsx",
          "operation": "modify",
          "description": "Integrate TrendlineDrawingTool as overlay on main price chart. Pass chart dimensions and scale functions to convert between pixel and data coordinates. Ensure trendlines scale correctly when timeframe changes by storing them in data coordinate space rather than pixel space. Add control buttons for enabling drawing mode and clearing trendlines."
        }
      ]
    },
    {
      "id": "REQ-62",
      "summary": "Update useICPPriceData hook to integrate CoinGecko API for accurate real-time ICP pricing that matches major exchanges",
      "acceptanceCriteria": [
        "CoinGecko API is used to fetch current ICP spot price",
        "Historical price data is fetched from CoinGecko for all supported timeframes (24h, 7d, 30d, 90d, 180d)",
        "Price data accurately reflects ICP prices from major exchanges",
        "API requests include proper error handling and fallback mechanisms",
        "Price updates occur at appropriate intervals to maintain accuracy"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useICPPriceData.ts",
          "operation": "modify",
          "description": "Replace Kong Swap API calls with CoinGecko API. Use CoinGecko endpoint: GET https://api.coingecko.com/api/v3/simple/price?ids=internet-computer&vs_currencies=usd for current price. Use GET https://api.coingecko.com/api/v3/coins/internet-computer/market_chart?vs_currency=usd&days={days} for historical data where days maps to timeframe (1 for 24H, 7 for 7D, 30 for 30D, 90 for 90D, 180 for 180D). Parse response.prices array containing [timestamp, price] pairs. Include error handling with fallback to synthetic data if API fails. Set appropriate refetch intervals (30s for current price, 5min for historical)."
        }
      ]
    }
  ]
}